#Область ПерваяПрограмма
//ДвухзначноеЧисло = 50;
//Степень = 2;


//Граница = 10000;

//Результат = 1;

//Для Индекс = 1 по Степень Цикл
	
//		Результат = Результат * ДвухзначноеЧисло;
		
//КонецЦикла;

//Сообщить(Результат);

//Если Результат > Граница Тогда
// 	Сообщить("Превышает границу в 10000");
//Иначе Сообщить("Не привышает граничное значение в 10000");
//КонецЕсли;
#КонецОбласти

#Область КонецГода1
КонецГода = КонецГода(ТекущаяДата());

Для Индекс = 1 по 10 Цикл
	
		ДеньНедели = ДеньНедели(КонецГода);
		
		Если ДеньНедели = 1 Тогда
			Сообщить("Понедельник");
		ИначеЕсли ДеньНедели = 2 Тогда
			Сообщить("Вторник");
		ИначеЕсли ДеньНедели = 2 Тогда
			Сообщить("Вторник");
		ИначеЕсли ДеньНедели = 3 Тогда
			Сообщить("Среда");
		ИначеЕсли ДеньНедели = 4 Тогда
			Сообщить("Четверг");
		ИначеЕсли ДеньНедели = 5 Тогда
			Сообщить("Пятница");
		ИначеЕсли ДеньНедели = 6 Тогда
			Сообщить("Суббота");
		Иначе 
			Сообщить("Воскресенье");
		КонецЕсли;
		
		КонецГода = КонецГода(КонецДня(КонецГода)+1);
		
КонецЦикла;
#КонецОбласти		
		
		