Процедура ОбработкаПроведения(Отказ,Режим)
	

	// регистр РегистрНачисления
	Движения.РегистрНачисления.Записывать = Истина;
	Движение = Движения.РегистрНачисления.Добавить();
	Движение.Сторно = Ложь;
	Движение.ВидРасчета = ПланыВидовРасчета.Начисления.ОкладПоТарифу;
	Движение.ПериодРегистрации = Дата;
	Движение.ПериодДействияНачало = НачалоМесяца(Дата);
	Движение.ПериодДействияКонец = КонецМесяца(Дата);
	Движение.Сотрудник = Сотрудник;
	Движение.РасчетныеДанные = ДневнойТариф;
	

	Движения.Записать();
	
	  
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РегистрНачисленияДанныеГрафика.РасчетныеДанные,
		|	РегистрНачисленияДанныеГрафика.РабочийДеньФактическийПериодДействия КАК Факт
		|ИЗ
		|	РегистрРасчета.РегистрНачисления.ДанныеГрафика(Регистратор = &Ссылка) КАК РегистрНачисленияДанныеГрафика";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Результат = ВыборкаДетальныеЗаписи.РасчетныеДанные * ВыборкаДетальныеЗаписи.факт;
		Движение.Результат = Результат;
	КонецЕсли;
	  
	Движения.РегистрНачисления.Записать();
	Движения.ЗадолженостьПередСотрудниками.Записывать = Истина;
	
		Движение = Движения.ЗадолженостьПередСотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = Сотрудник;
	    Движение.Долг = Результат;
	

КонецПроцедуры