
Процедура УсловиеПроверкаУсловия(ТочкаМаршрута, Результат)
	Результат = ПройденТестАдминистрирования;
КонецПроцедуры

Процедура ПрошелТестНаПрограммированиеПроверкаУсловия(ТочкаМаршрута, Результат)
	Результат = ПройденТестАдминистрирования;
КонецПроцедуры

Процедура Действие1ПриВыполнении(ТочкаМаршрута, Задача, Отказ)
	ПредложеннаяВакансия = Перечисления.Вакансии.Оператор;
КонецПроцедуры

Процедура Действие2ПриВыполнении(ТочкаМаршрута, Задача, Отказ)
	ПредложеннаяВакансия = Перечисления.Вакансии.Администратор;
КонецПроцедуры

Процедура Действие3ПриВыполнении(ТочкаМаршрута, Задача, Отказ)
	ПредложеннаяВакансия = Перечисления.Вакансии.Программист;
КонецПроцедуры




